components/MenuWidget.php

  public function run() {
    $this->data = Category::find()->indexBy('id')->asArray()->all();
---
SELECT * FROM `category`